Revit 2027 API
BuiltInFailures.SketchFailures.PathReinforcementManyLoops Property
 Sketch contains more than one chain. Can't create Path Reinforcement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PathReinforcementManyLoops { get; }
Public Shared ReadOnly Property PathReinforcementManyLoops As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PathReinforcementManyLoops {
	FailureDefinitionId^ get ();
}
static member PathReinforcementManyLoops : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace